---
### 데이터베이스
- 데이터가 크지 않으면 , csv나 json로 빼는 것도 무방하지만 데이터가 클 경우에는 데이터베이스에서 사용하는 것이 맞다. <br><br>

---
#### SQLite
- 가볍게 파일 하나로 사용할 수 있는 데이터베이스이다. <br><br>
    - DBMS가 따로 없다. <br><br>
    - 데이터만 저장하고 불러오고 할 수 있다. <br><br>

In [1]:
import sqlite3

In [7]:
# sqlite 데이터 베이스 연결하기
dbPath = '../Data/test.sqlite'
conn = sqlite3.connect(dbPath)

# 테이블을 생성하고 데이터 넣기
curs = conn.cursor()
# 여러줄
curs.executescript(
    """
    DROP TABLE IF EXISTS items;

    CREATE TABLE items (
        item_id INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT UNIQUE,
        price INTEGER

    );

    INSERT INTO items (name, price) VALUES ('Apple',800);
    INSERT INTO items (name, price) VALUES ('Banana',430);
    INSERT INTO items (name, price) VALUES ('Orange',780);
    """
)

# 위의 작업을 데이터베이스에 반영하기
conn.commit()

In [12]:
# 데이터 추출하기
curs = conn.cursor()
# 한줄
curs.execute("SELECT * FROM items")
item_list = curs.fetchall()

for item in item_list:
    print(item[0],item[1],item[2])

1 Apple 800
2 Banana 430
3 Orange 780

In [35]:
dbPath = '../Data/test2.sqlite'
conn = sqlite3.connect(dbPath)

# 테이블을 생성하고 데이터 넣기
curs = conn.cursor()

conn.execute('drop table if exists items')
conn.execute(
    """
    create table items
    (item_id integer primary key autoincrement,
    name varchar(45),
    price integer
    )
    """
)

conn.commit()

In [36]:
# 데이터 넣기
curs = conn.cursor()
curs.execute("insert into items (name, price) values (? , ?)",('Orange',5200))
conn.commit()

In [38]:
curs = conn.cursor()
curs.execute('select * from items')
items = curs.fetchall()
items

[(1, 'Orange', 5200)]

In [41]:
# 여러 데이터를 연속으로 넣기
curs= conn.cursor()

data = [('Mango',7700),('Kiwi',4000),('Peach',9400),('Persimmon',5200),('Melon',4000)]

curs.executemany('insert into items (name, price) values (?,?)',data)

conn.commit()

In [42]:
curs.execute('select * from items')
items = curs.fetchall()
items

[(1, 'Orange', 5200),
 (2, 'Mango', 7700),
 (3, 'Watermelon', 7700),
 (4, 'Peach', 7700),
 (5, 'Persimmon', 7700),
 (6, 'Melon', 7700),
 (7, 'Mango', 7700),
 (8, 'Kiwi', 4000),
 (9, 'Peach', 9400),
 (10, 'Persimmon', 5200),
 (11, 'Melon', 4000)]

In [44]:
curs.execute('select * from items where price between 4000 and 7000')
items = curs.fetchall()

for item in items:
    print(item)

(1, 'Orange', 5200)
(8, 'Kiwi', 4000)
(10, 'Persimmon', 5200)
(11, 'Melon', 4000)

---
### MySQL

In [45]:
#!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 43.8/43.8 kB 2.6 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [46]:
import pymysql

In [60]:
# Connection
conn = pymysql.connect(host = '127.0.0.1',user = 'root',password = 'tnstjd12',db = 'education',charset = 'utf8')

In [61]:
# cursor
curs = conn.cursor()

sql = 'select * from student'
curs.execute(sql)

rows = curs.fetchall()

# 리스트로 변환하기
row_list = list(rows)
row_list

[('S001', '권순형', '전자공학과', '123-4567', None),
 ('S002', '김진형', '철학과', '203-2391', None),
 ('S003', '정윤현', '컴퓨터공학과', '456-7890', None),
 ('S004', '이호식', '전산학과', '010-2345', None),
 ('S005', '이영진', '호텔경영학과', '494-2939', None),
 ('S006', '황정숙', '사학과', '678-9012', None),
 ('S007', '신오수', '국문학과', '010-1111', '화성시'),
 ('S008', '김한별', '심리학과', '011-1111', '속초시'),
 ('S009', '안수빈', '체육학과', '016-1111', '제주시')]

In [56]:
# insert
sql = 'insert into student values (%s,%s,%s,%s,%s)'
curs.execute(sql,('S007','신오수','국문학과','010-1111','화성시'))
curs.execute(sql,('S008','김한별','심리학과','011-1111','속초시'))
curs.execute(sql,('S009','안수빈','체육학과','016-1111','제주시'))

conn.commit()

In [57]:
# 확인하기
sql = 'select * from student'
curs.execute(sql)

rows = curs.fetchall()

# 리스트로 변환하기
row_list = list(rows)
row_list

[('S001', '권순형', '전자공학과', '123-4567', None),
 ('S002', '김진형', '철학과', '203-2391', None),
 ('S003', '정윤현', '컴퓨터공학과', '456-7890', None),
 ('S004', '이호식', '전산학과', '010-2345', None),
 ('S005', '이영진', '호텔경영학과', '494-2939', None),
 ('S006', '황정숙', '사학과', '678-9012', None),
 ('S007', '신오수', '국문학과', '010-1111', '화성시'),
 ('S008', '김한별', '심리학과', '011-1111', '속초시'),
 ('S009', '안수빈', '체육학과', '016-1111', '제주시')]

In [58]:
# 종료하기
# conn.close()

In [62]:
# insert 여러줄
data = (
   ('S010','신오수','국문학과','010-1234','화성시'),
   ('S011','무궁화','심리학과','010-1123','오산시'),
   ('S012','이상혁','경제학과','010-2432','평택시')
)

sql = 'insert into student values (%s,%s,%s,%s,%s)'

curs.executemany(sql,data)
conn.commit()

In [64]:
conn.close()

---
### select 내용을 dataframe으로 보기

In [65]:
!pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-1.4.46.tar.gz (8.5 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 8.5/8.5 MB 6.5 MB/s eta 0:00:0000:0100:01
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (setup.py) ... done
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.4.46-cp39-cp39-macosx_11_0_arm64.whl size=1561273 sha256=dbce876b824ea34926bc97c96dd420908f4495c3977317d8d8ca27579bbf1a07
  Stored in directory: /Users/kwonsoonhyong/Library/Caches/pip/wheels/2e/7a/c5/c4adc0fde658e83ef6ece76c8a7f115fc378c85774d9e5fd42
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-1.4.46

In [66]:
import pandas as pd
from sqlalchemy import create_engine

In [67]:
# connect 하는 부분 sqlachemy 이용해서
engine = create_engine('mysql+pymysql://root:tnstjd12@127.0.0.1:3306/education')
conn = engine.connect()

In [69]:
# 한 방에 데이터프레임으로 만들어 준다.
data = pd.read_sql_table('student',conn)
data

   scode sname   sdept    sphone saddress
0   S001   권순형   전자공학과  123-4567     None
1   S002   김진형     철학과  203-2391     None
2   S003   정윤현  컴퓨터공학과  456-7890     None
3   S004   이호식    전산학과  010-2345     None
4   S005   이영진  호텔경영학과  494-2939     None
5   S006   황정숙     사학과  678-9012     None
6   S007   신오수    국문학과  010-1111      화성시
7   S008   김한별    심리학과  011-1111      속초시
8   S009   안수빈    체육학과  016-1111      제주시
9   S010   신오수    국문학과  010-1234      화성시
10  S011   무궁화    심리학과  010-1123      오산시
11  S012   이상혁    경제학과  010-2432      평택시

In [70]:
conn.close()

---
### csv 파일 DB에 넣기
- csv 파일을 dataframe으로 만든 후에 DB에 넣어줘야 된다. <br><br>
- 또는 crawling , scrapying 한 것을 dataframe을 DB에 넣는 방법

In [71]:
movies=pd.read_csv('../Data/DaumList.csv')
movies.head()

   Rank              Title
0     1          아바타: 물의 길
1     2         더 퍼스트 슬램덩크
2     3                 영웅
3     4  장화신은 고양이: 끝내주는 모험
4     5                스위치

In [72]:
# column 이름 바꾸기 DB에 맞추기 dnlgo
columns = ['rank','title']
movies.columns = columns
movies.head()

   rank              title
0     1          아바타: 물의 길
1     2         더 퍼스트 슬램덩크
2     3                 영웅
3     4  장화신은 고양이: 끝내주는 모험
4     5                스위치

In [73]:
engine = create_engine('mysql+pymysql://root:tnstjd12@127.0.0.1:3306/daum')
conn = engine.connect()

In [74]:
# if_exists : append 해야 추가로 들어감 / replace 등등 있다.
movies.to_sql(name='movie',con=engine, if_exists='append',index=False)

15

---
### TinyDB
- noSQL 문서형 데이터베이스 <br><br>
- MongoDB가 대표적이지만 MongoDB는 설치가 필요하고, TinyDB는 패키지만 설치하면 됨

In [75]:
#!pip install tinydb

Collecting tinydb
  Downloading tinydb-4.7.1-py3-none-any.whl (24 kB)
Installing collected packages: tinydb
Successfully installed tinydb-4.7.1

In [76]:
from tinydb import TinyDB , Query , where

In [77]:
# 데이터베이스 연결하기
filePath = '../Data/tinydb.json'
db = TinyDB(filePath)

In [78]:
# 기존 테이블이 있다면 제거하기
db.drop_table('fruits')

In [79]:
# 테이블 생성하기
table=db.table('fruits')

In [80]:
# 테이블에 데이터 넣기
table.insert({'name':'apple','price':700})

1

In [81]:
data = {'name':'orange','price':1000}
data2 = {'name':'mango','price':2000}
table.insert(data)
table.insert(data2)

3

In [82]:
# 모든 데이터 출력
print(table.all())

[{'name': 'apple', 'price': 700}, {'name': 'orange', 'price': 1000}, {'name': 'mango', 'price': 2000}]

In [85]:
# Orange 검색하기
item = Query()
res = table.search(item.name == 'orange')
print(res[0]['price'])

1000

In [87]:
# 가격이 800원 이상인 것만 추출하기
res = table.search(item.price >= 800)

for i in res:
    print(i['name'])

orange
mango

In [90]:
# 수정하기
table.update({'price':84000},item.name == 'mango')
res = table.search(where('name') == 'mango')
print(res)

[{'name': 'mango', 'price': 84000}]

In [91]:
# 삭제하기
table.remove(where('name') == 'mango')
print(table.all())

[{'name': 'apple', 'price': 700}, {'name': 'orange', 'price': 1000}]